HANDLING MISSING DATA

In [109]:
import numpy as np
import pandas as pd

In [110]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [111]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [112]:
# built-in Python 'None' is also considered as NA in object arrays
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

FILTERING OUT MISSING DATA

In [113]:
from numpy import nan as NA

In [114]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [115]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [116]:
# equivalent way
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [117]:
# DF objects - dropna drops any row with missing value
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [118]:
cleaned = data.dropna()

In [119]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [120]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [121]:
# passing how='all' - drop rows that are all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [122]:
# drop columns with axis=1
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [123]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [124]:
# keep rows containing a certain number of observations - use thresh
df = pd.DataFrame(np.random.randn(7, 3))

In [125]:
df

          0         1         2
0  1.007189 -1.296221  0.274992
1  0.228913  1.352917  0.886429
2 -2.001637 -0.371843  1.669025
3 -0.438570 -0.539741  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [126]:
df.iloc[:4, 1] = NA

In [127]:
df

          0         1         2
0  1.007189       NaN  0.274992
1  0.228913       NaN  0.886429
2 -2.001637       NaN  1.669025
3 -0.438570       NaN  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [128]:
df.iloc[:2, 2] = NA

In [129]:
df

          0         1         2
0  1.007189       NaN       NaN
1  0.228913       NaN       NaN
2 -2.001637       NaN  1.669025
3 -0.438570       NaN  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [130]:
df.dropna()

          0         1         2
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [131]:
# using thresh
df.dropna(thresh=2)

          0         1         2
2 -2.001637       NaN  1.669025
3 -0.438570       NaN  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

FILLING IN MISSING DATA

In [132]:
# fillna - replaces missing value with a constant
df.fillna(0)

          0         1         2
0  1.007189  0.000000  0.000000
1  0.228913  0.000000  0.000000
2 -2.001637  0.000000  1.669025
3 -0.438570  0.000000  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [133]:
# calling fillna with a dictionary
df.fillna({1: 0.5, 2: 0.7})

          0         1         2
0  1.007189  0.500000  0.700000
1  0.228913  0.500000  0.700000
2 -2.001637  0.500000  1.669025
3 -0.438570  0.500000  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [134]:
_ = df.fillna(0, inplace=True)

In [135]:
df

          0         1         2
0  1.007189  0.000000  0.000000
1  0.228913  0.000000  0.000000
2 -2.001637  0.000000  1.669025
3 -0.438570  0.000000  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [136]:
# interpolation methods for reindexing can be used with fillna
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827 -1.063512  0.332883
3 -2.359419 -0.199543 -1.541996
4 -0.970736 -1.307030  0.286350
5  0.377984 -0.753887  0.331286

In [137]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827       NaN  0.332883
3 -2.359419       NaN -1.541996
4 -0.970736       NaN       NaN
5  0.377984       NaN       NaN

In [138]:
df.fillna(method='ffill')

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827  0.560145  0.332883
3 -2.359419  0.560145 -1.541996
4 -0.970736  0.560145 -1.541996
5  0.377984  0.560145 -1.541996

In [139]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827  0.560145  0.332883
3 -2.359419  0.560145 -1.541996
4 -0.970736       NaN -1.541996
5  0.377984       NaN -1.541996

In [140]:
# pass mean value with fillna
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

DATA TRANSFORMATION

REMOVING DUPLICATES

In [141]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [142]:
# duplicated() returns a boolean Series
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [143]:
# drop_duplicates - returns a DF with duplicated array
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [144]:
# filtering based on selective columns
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [145]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [146]:
# duplicated and drop_duplicates keep the first observed value combination
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

TRANSFORMING DATA USING A FUNCTION OR MAPPING

In [147]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham',
                              'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [148]:
# mapping of each distinct meat type to the kind of animal
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [149]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [150]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [151]:
# pass a function to conduct above logic
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

REPLACING VALUES

In [152]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [153]:
# replace -999 i.e sentinel values with NA using replace
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [154]:
# replace multiple values
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [155]:
# replace by passing a dictionary
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

RENAMING AXIS INDEXES

In [156]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [157]:
transform = lambda x: x[:4].upper()

In [158]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [159]:
# assign above for DF
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [160]:
# create a transformed version of a dataset without modification to original
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [161]:
# using rename with a dictionary
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [162]:
# rename - saves work of copying DF manually
# to modify in-place

data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

DISCRETIZATION AND BINNING

In [163]:
# continuous data is separated into bins for analysis
# grouping them into discrete age buckets
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [164]:
# divide into bins of 18-25, 26-35, 36-60, 61-older
bins = [18, 25, 35, 60, 100]

In [165]:
# use cut to divide
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [166]:
# returned object is a special Categoricial object
# array of strings with the bin name
# internally contains a categories array with distinct category name along with labeling for ages data
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [167]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [168]:
# count elements in each category
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [169]:
# parenthesis means side is open whereas square bracket means side is closed

In [170]:
# use attribute right=False to switch side to be closed
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [171]:
# pass own bin names by passing a list or array to labels option
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [172]:
# passing an integer number of bins instead of explicit bin edges
# returns computed equal-length bins based on min and max values
data = np.random.randn(20)

In [173]:
pd.cut(data, 4, precision=2)

[(0.44, 1.35], (-0.48, 0.44], (-0.48, 0.44], (-0.48, 0.44], (0.44, 1.35], ..., (0.44, 1.35], (-1.39, -0.48], (-0.48, 0.44], (-2.31, -1.39], (-1.39, -0.48]]
Length: 20
Categories (4, interval[float64]): [(-2.31, -1.39] < (-1.39, -0.48] < (-0.48, 0.44] < (0.44, 1.35]]

In [174]:
# precision=2 limits decimal precision to two digits

In [175]:
# qcut - bins data based on sample quantiles

In [176]:
data = np.random.randn(1000) # normally distributed
cats = pd.qcut(data, 4) # cut into quartiles
cats

[(-2.9499999999999997, -0.686], (-2.9499999999999997, -0.686], (0.619, 3.928], (0.619, 3.928], (0.619, 3.928], ..., (-2.9499999999999997, -0.686], (0.619, 3.928], (-0.029, 0.619], (-0.029, 0.619], (-2.9499999999999997, -0.686]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -0.686] < (-0.686, -0.029] < (-0.029, 0.619] < (0.619, 3.928]]

In [177]:
pd.value_counts(cats)

(0.619, 3.928]                   250
(-0.029, 0.619]                  250
(-0.686, -0.029]                 250
(-2.9499999999999997, -0.686]    250
dtype: int64

In [178]:
# passing custom quantiles (ex. numbers b/w 0 and 1)
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(-2.9499999999999997, -1.187], (-2.9499999999999997, -1.187], (-0.029, 1.286], (-0.029, 1.286], (-0.029, 1.286], ..., (-2.9499999999999997, -1.187], (-0.029, 1.286], (-0.029, 1.286], (-0.029, 1.286], (-1.187, -0.029]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -1.187] < (-1.187, -0.029] < (-0.029, 1.286] < (1.286, 3.928]]

In [179]:
# cut and qcut is extensively used for aggregations and group ops
# useful for quantile and group analysis

DETECTING AND FILTERING OUTLIERS

In [180]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [181]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.045383     0.024079    -0.004794    -0.050389
std       0.997796     1.008737     0.996599     0.996706
min      -3.645860    -3.184377    -3.745356    -3.428254
25%      -0.600254    -0.612162    -0.697084    -0.747478
50%       0.040150    -0.013609    -0.029924    -0.088274
75%       0.746527     0.690847     0.699046     0.623331
max       2.653656     3.525865     2.735527     3.366626

In [182]:
# finding values in one of the columns exceeding 3 in absolute value
col = data[2]

In [183]:
col[np.abs(col) > 3]

38    -3.399312
133   -3.745356
Name: 2, dtype: float64

In [184]:
# select all rows exceeding values over 3 or -3, use 'any' method on a boolean DF
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
38   0.457246 -0.025907 -3.399312 -0.974657
57   1.951312  3.260383  0.963301  1.201206
133  0.508391 -0.196713 -3.745356 -1.520113
232 -0.242459 -3.056990  1.918403 -0.578828
255  0.682841  0.326045  0.425384 -3.428254
319  1.179227 -3.184377  1.369891 -1.074833
541 -3.548824  1.553205 -2.186301  1.277104
632 -0.578093  0.193299  1.397822  3.366626
779 -0.207434  3.525865  0.283070  0.544635
800 -3.645860  0.255475 -0.549574 -1.907459

In [185]:
# capping values outside interval -3 to 3
data[np.abs(data) > 3] = np.sign(data) * 3

In [186]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.046577     0.023534    -0.003650    -0.050328
std       0.993777     1.005496     0.992788     0.994152
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.600254    -0.612162    -0.697084    -0.747478
50%       0.040150    -0.013609    -0.029924    -0.088274
75%       0.746527     0.690847     0.699046     0.623331
max       2.653656     3.000000     2.735527     3.000000

In [187]:
# np.sign - produces 1 and -1 values for positive/negative values
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0 -1.0  1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

PERMUTATION AND RANDOM SAMPLING

In [188]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))

In [189]:
sampler = np.random.permutation(5)
sampler

array([2, 4, 1, 0, 3])

In [190]:
# use iloc-based indexing or take function
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [191]:
# reordering of array done on the basis of sampler array elements as indexes
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [192]:
# random subset w/o replacement, use 'sample' method
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7

In [193]:
# generate sample with replacement i.e allow repeat choices
# use replace=True as args

In [194]:
choices = pd.Series([5, 7, -1, 6, 4])

In [195]:
draws = choices.sample(n=10, replace=True)
draws

4    4
1    7
2   -1
3    6
4    4
1    7
4    4
0    5
3    6
0    5
dtype: int64

COMPUTING INDICATOR/DUMMY VARIABLES

In [196]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [197]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [198]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [199]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [200]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [201]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [202]:
# for rows belonging to multiple categories
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

In [203]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [204]:
# extract unique genres
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)

In [205]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [206]:
# constructing indicator DF
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [207]:
# compute column indices for each genre
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [208]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [209]:
# using .iloc to set values based on these indices
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [210]:
# combine this with movies
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [215]:
# combining get_dummies with discretization function like cut
np.random.seed(12345)

In [216]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [217]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [218]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

STRING MANIPULATION

STRING OBJECT METHODS

In [219]:
# split comma separated string
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [220]:
# split combined with strip to remove whitespaces including line breaks
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [221]:
# substrings can be concatenated with two-colon delimiter
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [222]:
# using Pythonic way - pass list or tuple to join method
'::'.join(pieces)

'a::b::guido'

In [223]:
# using 'in' and 'find'
'guido' in val

True

In [224]:
val.index(',')

1

In [225]:
val.find(':')

-1

In [227]:
# find vs index - index raises exception if string is not found
# val.index(':') - ValueError: substring not found

In [228]:
# count returns number of occurances of a particular substring
val.count(',')

2

In [229]:
# replace - subs occurances of one pattern for another
val.replace(',', '::')

'a::b:: guido'

In [230]:
val.replace(',', '')

'ab guido'

REGULAR EXPRESSIONS

In [231]:
# re module
# 3 categories - pattern matching, substitution, and splitting

In [232]:
import re

In [233]:
text = "foo    bar\t baz  \tqux"

In [234]:
# split string with a variable number of whitespace chars
# tabs, spaces, and newlines
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [235]:
# self compiling regex forming a reusable regex object
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [236]:
# get a list of all patterns matching the regex
regex.findall(text)

['    ', '\t ', '  \t']

In [237]:
# compiling a re.compile object for reusability will reduce CPU cycles

In [255]:
text = """Dave dave@google.com
Steve steve@google.com
Rob rob@google.com
Ryan ryan@google.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [256]:
# below will make regex case-sensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [257]:
regex.findall(text)

['dave@google.com', 'steve@google.com', 'rob@google.com', 'ryan@google.com']

In [258]:
# search - returns a special match object for first email address

In [259]:
m = regex.search(text)
m

In [260]:
text[m.start():m.end()]

'dave@google.com'

In [261]:
# regex.match will return None as it will match if pattern occurs at start of the string

In [262]:
print(regex.match(text))

None

In [263]:
# sub - returns a new string with occurances of pattern
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [269]:
# segment string
pattern = r'([A-Z0-9.%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [270]:
m = regex.match('indrajeet.0072@gmail.com')
m.groups()

('indrajeet.0072', 'gmail', 'com')

In [271]:
# findall returns a list of tuples when pattern has groups
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'google', 'com'),
 ('rob', 'google', 'com'),
 ('ryan', 'google', 'com')]

In [272]:
# sub - has access to groups in each match
# access elements using \1 or \2.
# \1 - first matched group
# \2 - second matched group
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: google, Suffix: com
Rob Username: rob, Domain: google, Suffix: com
Ryan Username: ryan, Domain: google, Suffix: com

VECTORIZED STRING FUNCTIONS IN PANDAS

In [274]:
# handling columns containing strings and some missing data
data = {'Dave': 'dave@google.com',
        'Steve': 'steve@google.com',
        'Rob': 'rob@google.com',
        'Wes': np.nan}

data = pd.Series(data)
data

Dave      dave@google.com
Steve    steve@google.com
Rob        rob@google.com
Wes                   NaN
dtype: object

In [275]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool